{
  "movies": [
    {
      "name": "House of the Dragon",
      "genre": "Drama, Action & Adventure, Sci-Fi & Fantasy, Mystery",
      "overview": "The prequel series finds the Targaryen dynasty at the absolute apex of its power, with more than 15 dragons under their yoke. Most empires—real and imagined—crumble from such heights. In the case of the Targaryens, their slow fall begins almost 193 years before the events of Game of Thrones, when King Viserys Targaryen breaks with a century of tradition by naming his daughter Rhaenyra heir to the Iron Throne. But when Viserys later fathers a son, the court is shocked when Rhaenyra retains her status as his heir, and seeds of division sow friction across the realm.",
      "photo": "https://www.themoviedb.org/t/p/w220_and_h330_face/z2yahl2uefxDCl0nogcRBstwruJ.jpg",
      "rating": "88%",
      "id": 1
    },
    {
      "name": "She-Hulk: Attorney at Law",
      "genre": "Comedy, Sci-Fi & Fantasy",
      "overview": "Jennifer Walters navigates the complicated life of a single, 30-something attorney who also happens to be a green 6-foot-7-inch superpowered hulk.",
      "photo": "https://www.themoviedb.org/t/p/w300_and_h450_bestv2/hJfI6AGrmr4uSHRccfJuSsapvOb.jpg",
      "rating": "74%",
      "id": 2
    },
    {
      "name": "The Secret House",
      "genre": "Drama",
      "overview": "A story about quitting being a good boy and chasing evil to the end for the sake of the mother and sister who sacrificed for themselves. A revenge play in which a dirt spoon lawyer chasing the traces of his missing mother walks into the secret surrounding him to fight the world.",
      "photo": "https://www.themoviedb.org/t/p/w300_and_h450_bestv2/wNN9hJDV45BF2PiJQQVwBCiqLIl.jpg",
      "rating": "53%",
      "id": 3
    },
    {
      "name": "Nope",
      "genre": "Horror, Mystery, Science Fiction, Thriller",
      "overview": "Residents in a lonely gulch of inland California bear witness to an uncanny, chilling discovery.",
      "photo": "https://www.themoviedb.org/t/p/w300_and_h450_bestv2/AcKVlWaNVVVFQwro3nLXqPljcYA.jpg",
      "rating": "71%",
      "id": 4
    },
    {
      "name": "Your name",
      "genre": "Romance, Animation, Drama",
      "overview": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
      "photo": "https://www.themoviedb.org/t/p/w300_and_h450_bestv2/q719jXXEzOoYaps6babgKnONONX.jpg",
      "rating": "85%",
      "id": 5
    }
  ]
}